CSI API ETABS v1

# cSapModelDesignConcrete Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignConcrete DesignConcrete { get; }

    ReadOnly Property DesignConcrete As cDesignConcrete
    	Get

    Dim instance As cSapModel
    Dim value As cDesignConcrete

    value = instance.DesignConcrete

    property cDesignConcrete^ DesignConcrete {
    	cDesignConcrete^ get ();
    }

    abstract DesignConcrete : cDesignConcrete with get

#### Property Value

Type: cDesignConcrete

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com